package exercise_10;

import java.util.Scanner;

public class Exercise_10 {

    public static void main(String[] args) {
        
        int decimal, partition, remainder;
        
        String binary = ""; // Виж * по-долу.
        
        Scanner input = new Scanner(System.in);

        System.out.print("Въведи позитивно десетично число: ");
        
        decimal = input.nextInt();
        
        // Тук се оповаваме на филтър само от условието т.е. въвеждайте само позитивни десетични числа.
        // Ако потребителя въведе отрицателно такова или текст - ще даде грешка, но това не е част от задачата.

        do {

            partition = decimal / 2; // Делим десетичното число на 2 и получаваме цяло число. Записваме го към partition.

            remainder = decimal % 2; // Взимаме остатъка от десетичното число и го записваме към remainder.

            decimal = partition; 
            
            // Десетичното число получава стойността от горното делене на 2 (примерно 25/2 - сега става 12). 
            // При новото завъртане остатъка се изчислява от това число (т.е. не 25 % 2, а 12 % 2).        

            binary = remainder + binary;
            
            // При десетичното 25 резултата за remainder (остатък) е :
            // 1
            // 0
            // 0        
            // 1
            // 1
            
            // За правилно двоично представяне, трябва да инициализираме числата в обратен ред (т.е. 11001).
            // Това става като при всяко завъртане започваме с първото число (остатък) и след това добавяме следващия остатък пред него.
            
            // Пример за 25:
            // 1 - Първия остатък.
            // 01 - Добавяме втория остатък пред него.
            // 001 - Третия остатък пред горните два и прочие.
            // 1001
            // 11001 - Получаваме крайното число, като последния остатък е първи и така правилно се реализира двоичното представяне.
            
            // * binary е дефиниран като тип String, защото иначе добавяните остатъци към него ще започнат да се събират (т.е. вместо 11001, ще покаже 3).

        }

        while (decimal != 0); // Цикълът се върти докато десетичното число не е равно на 0 и вече няма какво да делим.

        System.out.println("Конвертирано в двоично число е: " + binary); // Вече извън цикъла извикваме крайното натрупало се число от остатъци като двоично представяне.    

    }
}